/*
 * adc.h
 *
 * Created: 18.10.2013 12:19:17
 *  Author: vmk
 */

#ifndef ADC_H_
#define ADC_H_
//---------------------------------------------------------------------------------------
#define F_CPU 16000000UL // or whatever may be your frequency
//---------------------------------------------------------------------------------------
#include <avr/io.h>
#include <util/delay.h>
//---------------------------------------------------------------------------------------
//#define ADC_VREF_TYPE			0x00
#define ADC_VREF_TYPE 0x40
//---------------------------------------------------------------------------------------
#define A_IN_1					0x00
#define A_IN_2					0x01
#define A_IN_3					0x02
#define A_IN_4					0x03
//---------------------------------------------------------------------------------------
/**************************************************************************
*   Function name : init_adc
*   Returns :
*   Parameters :
*   Purpose :       Ініціалізаціяу АЦП
****************************************************************************/
void init_adc(void);
/**************************************************************************
*   Function name : read_adc
*   Returns :       Результати оцифровки
*   Parameters :    Канал АЦП
*   Purpose :       Оцифровка по указаному каналу
****************************************************************************/
unsigned int read_adc(unsigned char adc_input);
/**************************************************************************
*   Function name : rd_adc
*   Returns :       Результати оцифровки
*   Parameters :    Канал АЦП
*   Purpose :       Оцифровка по указаному каналу і розрахунок середнього арифметичного з 4х вимірів по указаному каналу АЦП
****************************************************************************/
unsigned int get_average_adc(unsigned char adc_input);
//***************************************************************************************
//***************************************************************************************
//***************************************************************************************
#endif /* ADC_H_ */


