/*
 * buttons.c
 *
 * Created: 13.09.2015 16:16:21
 *  Author: Администратор
 */ 

#include "buttons.h"

/**************************************************************************
*   Function name : BUT_Init
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       инициализация портов ввода/вывода
*                   вызывается обычно в начале main`a
****************************************************************************/
void BUT_Init(void)
{
	DDRX_BUTTON &= ~(MASK_BUTTON);
	PORT_BUTTON |= MASK_BUTTON;
};
/**************************************************************************
*   Function name : BUT_Debrief
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       опрашивает кнопки. вызывается обычно из прерывания
*                   если кнопка нажата в течении 20 прерываний,
*                   ее номер записывается в буфер
****************************************************************************/
void BUT_Debrief(void)
{
	//---------------------------------------------------------------------------------------
	unsigned char key;
	//---------------------------------------------------------------------------------------
	if((((PIN_BUTTON)>>(OK))&1)==0)
	{
		key = KEY_OK;
	}else if ((((PIN_BUTTON)>>(UP))&1)==0)
	{
		key = KEY_DOWN;
	}else if ((((PIN_BUTTON)>>(DOWN))&1)==0)
	{
		key = KEY_UP;
	}else if ((((PIN_BUTTON)>>(RIGHT))&1)==0)
	{
		key = KEY_RIGHT;
	}
	else if ((((PIN_BUTTON)>>(LEFT))&1)==0)
	{
		key = KEY_LEFT;
	}
	else if ((((PIN_BUTTON)>>(KEY_ESC))&1)==0)
	{
		key = KEY_ESC;
	}else
	{
		key = KEY_NULL;
	};
	//---------------------------------------------------------------------------------------
	#ifdef norm
	//---------------------------------------------------------------------------------------
	//если во временной переменной что-то есть
	if (key!=0)
	{
		//и если кнопка удерживается долго
		//записать ее номер в буфер
		if (comp == THRESHOLD)
		{
			comp = THRESHOLD+10;
			pressedKey = key;
			return;
		}
		else if (comp < (THRESHOLD+5))
		{
			comp++;
		};
	}
	else
	{
		comp=0;
	};
	//---------------------------------------------------------------------------------------
	#endif
	#ifdef lin
	//---------------------------------------------------------------------------------------
	//если во временной переменной что-то есть
	if (key!=0)
	{
		//и если кнопка удерживается очень долго
		//то опять пишем ее номер в буфер
		if (comp > THRESHOLD2)
		{
			comp = THRESHOLD2 - 40;
			pressedKey = key;
			return;
		}
		else
		{
			comp++;
		};
		//и если кнопка удерживается долго
		//записать ее номер в буфер
		if (comp == THRESHOLD)
		{
			pressedKey = key;
			return;
		};
	}
	else
	{
		comp=0;
	};
	//---------------------------------------------------------------------------------------
	#endif
};
/**************************************************************************
*   Function name : BUT_GetKey
*   Returns :       номер нажатой кнопки
*   Parameters :    нет
*   Purpose :       возвращает содержимое кнопочного буфера
*                   при этом буфер очищается
*                   вызывается обычно в main`e в цикле while
*
****************************************************************************/
unsigned char BUT_GetKey(void)
{
	unsigned char key = pressedKey;
	pressedKey = KEY_NULL;
	return key;
};
/**************************************************************************
*   Function name : BUT_SetKey
*   Returns :       нет
*   Parameters :    номер кнопки
*   Purpose :       записывает в кнопочный буфер значение
*                   требуется иногда для имитации нажатия кнопок
****************************************************************************/
void BUT_SetKey(unsigned char key)
{
	pressedKey = key;
};